Revit 2027 API
Subelement.GetParameterValue Method
 Obtains the current parameter value of this subelement given a parameter id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ParameterValue GetParameterValue(
	ElementId parameterId
)
Public Function GetParameterValue (
	parameterId As ElementId
) As ParameterValue
public:
ParameterValue^ GetParameterValue(
	ElementId^ parameterId
)
member GetParameterValue :
        parameterId : ElementId -> ParameterValue
Parameters
parameterId ElementId
 Parameter id.
Return Value
ParameterValue
 Parameter value.
Exceptions
Exception | Condition
ArgumentException |  parameterId does not identify a valid parameter of this subelement.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace